#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.delete_lambda.data.archive_file.lambda: Reading...
module.redirect_lambda.data.archive_file.lambda: Reading...
module.create_short_url_lambda.data.archive_file.lambda: Reading...
module.delete_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.redirect_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.create_short_url_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.delete_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Reading...
aws_api_gateway_rest_api.url_shortener_api: Refreshing state... [id=i2kdus2i80]
aws_dynamodb_table.urls: Refreshing state... [id=urls]
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.delete_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.create_short_url_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=create-short-url-899a42c-lambda-role]
module.redirect_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=redirect-899a42c-lambda-role]
module.delete_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=delete-899a42c-lambda-role]
aws_api_gateway_resource.redirect_resource: Refreshing state... [id=pgxnc5]
module.delete_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-i2kdus2i80-l9g1ngfv6l-DELETE]
module.post_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-i2kdus2i80-l9g1ngfv6l-POST]
module.redirect_url_method.aws_api_gateway_method.method: Refreshing state... [id=agm-i2kdus2i80-pgxnc5-GET]
module.delete_lambda.aws_lambda_function.lambda: Refreshing state... [id=delete-899a42c]
module.redirect_lambda.aws_lambda_function.lambda: Refreshing state... [id=redirect-899a42c]
module.create_short_url_lambda.aws_lambda_function.lambda: Refreshing state... [id=create-short-url-899a42c]
module.delete_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.delete_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-i2kdus2i80-l9g1ngfv6l-DELETE]
module.redirect_url_method.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.redirect_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-i2kdus2i80-pgxnc5-GET]
module.post_url_method.aws_api_gateway_integration.integration: Refreshing state... [id=agi-i2kdus2i80-l9g1ngfv6l-POST]
aws_api_gateway_deployment.url_shortener_api_deployment: Refreshing state... [id=91ov5d]
aws_api_gateway_stage.live: Refreshing state... [id=ags-i2kdus2i80-live]
aws_api_gateway_usage_plan.usage: Refreshing state... [id=ukszus]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_dynamodb_table.urls has been deleted
  - resource "aws_dynamodb_table" "urls" {
      - arn                         = "arn:aws:dynamodb:us-east-1:692735942459:table/urls" -> null
        id                          = "urls"
        name                        = "urls"
        # (12 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.allow_delete_url_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_delete_url_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.allow_get_url_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_get_url_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dax:Query",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.create_short_url_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "create_short_url_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:PutItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_api_gateway_deployment.url_shortener_api_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "url_shortener_api_deployment" {
      ~ created_date  = "2024-05-25T00:30:38Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:692735942459:i2kdus2i80/" -> (known after apply)
      ~ id            = "91ov5d" -> (known after apply)
      ~ invoke_url    = "https://i2kdus2i80.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "f49804c52aa023d7cbd0781c5da6c9be3c1df669" -> "0c07748f57681d3f730a6578a03d9685e677c9da"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_stage.live will be updated in-place
  ~ resource "aws_api_gateway_stage" "live" {
      ~ deployment_id         = "91ov5d" -> (known after apply)
        id                    = "ags-i2kdus2i80-live"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

  # aws_dynamodb_table.urls will be created
  + resource "aws_dynamodb_table" "urls" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "ID"
      + id               = (known after apply)
      + name             = "urls"
      + range_key        = "Code"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "Code"
          + type = "S"
        }
      + attribute {
          + name = "ID"
          + type = "S"
        }
      + attribute {
          + name = "URL"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "Code"
          + name               = "CodeIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "URL"
          + read_capacity      = 1
          + write_capacity     = 1
        }
    }

  # module.create_short_url_lambda.data.aws_iam_policy_document.policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policies" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = [
          + (known after apply),
        ]

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "LogToCloudwatch"
        }
    }

  # module.create_short_url_lambda.aws_iam_role.iam_for_lambda must be replaced
+/- resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::692735942459:role/create-short-url-899a42c-lambda-role" -> (known after apply)
      ~ create_date           = "2024-05-25T00:30:18Z" -> (known after apply)
      ~ id                    = "create-short-url-899a42c-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "create-short-url-899a42c-lambda-role" -> "create-short-url-5178516-lambda-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2CSSHT45WAZO5JSZE" -> (known after apply)
        # (6 unchanged attributes hidden)

      - inline_policy {
          - name   = "DefaultPolicy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:*:*:*"
                          - Sid      = "LogToCloudwatch"
                        },
                      - {
                          - Action   = "dynamodb:PutItem"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:us-east-1:692735942459:table/urls"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = "DefaultPolicy"
          + policy = (known after apply)
        }
    }

  # module.create_short_url_lambda.aws_lambda_function.lambda must be replaced
+/- resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:692735942459:function:create-short-url-899a42c" -> (known after apply)
      ~ code_sha256                    = "slQbp92P5eqcux38WC+G18045G8xtUSaDaIDR4KrZlI=" -> (known after apply)
      ~ filename                       = "create-short-url-899a42c_lambda_function_payload.zip" -> "create-short-url-5178516_lambda_function_payload.zip"
      ~ function_name                  = "create-short-url-899a42c" -> "create-short-url-5178516" # forces replacement
      ~ id                             = "create-short-url-899a42c" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url-899a42c/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-25T00:35:35.547+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:692735942459:function:create-short-url-899a42c:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url-899a42c:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::692735942459:role/create-short-url-899a42c-lambda-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 294 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/create-short-url-899a42c" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.delete_lambda.data.aws_iam_policy_document.policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policies" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = [
          + (known after apply),
        ]

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "LogToCloudwatch"
        }
    }

  # module.delete_lambda.aws_iam_role.iam_for_lambda must be replaced
+/- resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::692735942459:role/delete-899a42c-lambda-role" -> (known after apply)
      ~ create_date           = "2024-05-25T00:30:18Z" -> (known after apply)
      ~ id                    = "delete-899a42c-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "delete-899a42c-lambda-role" -> "delete-url-5178516-lambda-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2CSSHT45Z6NFM7GLJ" -> (known after apply)
        # (6 unchanged attributes hidden)

      - inline_policy {
          - name   = "DefaultPolicy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:*:*:*"
                          - Sid      = "LogToCloudwatch"
                        },
                      - {
                          - Action   = [
                              - "dynamodb:Query",
                              - "dynamodb:GetItem",
                              - "dax:Query",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:us-east-1:692735942459:table/urls/index/*",
                              - "arn:aws:dynamodb:us-east-1:692735942459:table/urls",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = "DefaultPolicy"
          + policy = (known after apply)
        }
    }

  # module.delete_lambda.aws_lambda_function.lambda must be replaced
+/- resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:692735942459:function:delete-899a42c" -> (known after apply)
      ~ code_sha256                    = "slQbp92P5eqcux38WC+G18045G8xtUSaDaIDR4KrZlI=" -> (known after apply)
      ~ filename                       = "delete-899a42c_lambda_function_payload.zip" -> "delete-url-5178516_lambda_function_payload.zip"
      ~ function_name                  = "delete-899a42c" -> "delete-url-5178516" # forces replacement
      ~ id                             = "delete-899a42c" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:delete-899a42c/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-25T00:30:38.155+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:692735942459:function:delete-899a42c:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:delete-899a42c:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::692735942459:role/delete-899a42c-lambda-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 294 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/delete-899a42c" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.delete_url_method.aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-i2kdus2i80-l9g1ngfv6l-DELETE"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url-899a42c/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.delete_url_method.aws_lambda_permission.apigw_lambda must be replaced
-/+ resource "aws_lambda_permission" "apigw_lambda" {
      ~ function_name       = "create-short-url-899a42c" -> "delete-url-5178516" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.post_url_method.aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-i2kdus2i80-l9g1ngfv6l-POST"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:create-short-url-899a42c/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.post_url_method.aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "create-short-url-5178516"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:692735942459:i2kdus2i80/*/POST/"
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # module.redirect_lambda.data.aws_iam_policy_document.policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policies" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = [
          + (known after apply),
        ]

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "LogToCloudwatch"
        }
    }

  # module.redirect_lambda.aws_iam_role.iam_for_lambda must be replaced
+/- resource "aws_iam_role" "iam_for_lambda" {
      ~ arn                   = "arn:aws:iam::692735942459:role/redirect-899a42c-lambda-role" -> (known after apply)
      ~ create_date           = "2024-05-25T00:30:18Z" -> (known after apply)
      ~ id                    = "redirect-899a42c-lambda-role" -> (known after apply)
      ~ managed_policy_arns   = [] -> (known after apply)
      ~ name                  = "redirect-899a42c-lambda-role" -> "redirect-5178516-lambda-role" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {} -> null
      ~ tags_all              = {} -> (known after apply)
      ~ unique_id             = "AROA2CSSHT45TDJ7QYQVF" -> (known after apply)
        # (6 unchanged attributes hidden)

      - inline_policy {
          - name   = "DefaultPolicy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:*:*:*"
                          - Sid      = "LogToCloudwatch"
                        },
                      - {
                          - Action   = [
                              - "dynamodb:Query",
                              - "dynamodb:GetItem",
                              - "dax:Query",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:us-east-1:692735942459:table/urls/index/*",
                              - "arn:aws:dynamodb:us-east-1:692735942459:table/urls",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = "DefaultPolicy"
          + policy = (known after apply)
        }
    }

  # module.redirect_lambda.aws_lambda_function.lambda must be replaced
+/- resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:692735942459:function:redirect-899a42c" -> (known after apply)
      ~ code_sha256                    = "slQbp92P5eqcux38WC+G18045G8xtUSaDaIDR4KrZlI=" -> (known after apply)
      ~ filename                       = "redirect-899a42c_lambda_function_payload.zip" -> "redirect-5178516_lambda_function_payload.zip"
      ~ function_name                  = "redirect-899a42c" -> "redirect-5178516" # forces replacement
      ~ id                             = "redirect-899a42c" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect-899a42c/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-25T00:30:32.367+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:692735942459:function:redirect-899a42c:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect-899a42c:$LATEST/invocations" -> (known after apply)
      ~ role                           = "arn:aws:iam::692735942459:role/redirect-899a42c-lambda-role" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      ~ source_code_size               = 294 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/redirect-899a42c" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.redirect_url_method.aws_api_gateway_integration.integration will be updated in-place
  ~ resource "aws_api_gateway_integration" "integration" {
        id                      = "agi-i2kdus2i80-pgxnc5-GET"
      ~ uri                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:692735942459:function:redirect-899a42c/invocations" -> (known after apply)
        # (15 unchanged attributes hidden)
    }

  # module.redirect_url_method.aws_lambda_permission.apigw_lambda must be replaced
-/+ resource "aws_lambda_permission" "apigw_lambda" {
      ~ function_name       = "redirect-899a42c" -> "redirect-5178516" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 11 to add, 4 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @EsmerlinJM, Action: `pull_request`*